ProyectoWeb/reporte_html/statistics.json
{
  "GET Factura por ID" : {
    "transaction" : "GET Factura por ID",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 451.98000000000013,
    "medianResTime" : 431.0,
    "minResTime" : 202.0,
    "maxResTime" : 1535.0,
    "pct1ResTime" : 619.7,
    "pct2ResTime" : 696.6499999999999,
    "pct3ResTime" : 1462.0700000000013,
    "throughput" : 9.47867298578199,
    "receivedKBytesPerSec" : 1.9707123815165877,
    "sentKBytesPerSec" : 1.8050207345971565
  },
  "GET Servicio por ID" : {
    "transaction" : "GET Servicio por ID",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 546.7699999999998,
    "medianResTime" : 469.0,
    "minResTime" : 152.0,
    "maxResTime" : 1772.0,
    "pct1ResTime" : 1083.3000000000006,
    "pct2ResTime" : 1317.9,
    "pct3ResTime" : 1529.98,
    "throughput" : 22.01188641866608,
    "receivedKBytesPerSec" : 4.688058895553599,
    "sentKBytesPerSec" : 4.2132126348228045
  },
  "GET Producto por ID" : {
    "transaction" : "GET Producto por ID",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 535.7579999999999,
    "medianResTime" : 456.5,
    "minResTime" : 145.0,
    "maxResTime" : 2200.0,
    "pct1ResTime" : 1002.9000000000008,
    "pct2ResTime" : 1289.9,
    "pct3ResTime" : 1536.0,
    "throughput" : 21.866526720895653,
    "receivedKBytesPerSec" : 4.657100402890755,
    "sentKBytesPerSec" : 4.185389880171433
  },
  "GET Servicios" : {
    "transaction" : "GET Servicios",
    "sampleCount" : 500,
    "errorCount" : 268,
    "errorPct" : 53.6,
    "meanResTime" : 660.2079999999991,
    "medianResTime" : 518.0,
    "minResTime" : 192.0,
    "maxResTime" : 2764.0,
    "pct1ResTime" : 1186.400000000001,
    "pct2ResTime" : 1447.85,
    "pct3ResTime" : 2457.7300000000005,
    "throughput" : 19.86728652600628,
    "receivedKBytesPerSec" : 244.63804442573607,
    "sentKBytesPerSec" : 3.608706341637859
  },
  "GET Solicitudes Pendientes" : {
    "transaction" : "GET Solicitudes Pendientes",
    "sampleCount" : 300,
    "errorCount" : 179,
    "errorPct" : 59.666668,
    "meanResTime" : 503.72333333333364,
    "medianResTime" : 457.0,
    "minResTime" : 165.0,
    "maxResTime" : 1903.0,
    "pct1ResTime" : 750.6000000000015,
    "pct2ResTime" : 1176.2999999999993,
    "pct3ResTime" : 1532.0,
    "throughput" : 12.873326467559219,
    "receivedKBytesPerSec" : 2.5140282381779953,
    "sentKBytesPerSec" : 2.489178359938208
  },
  "GET Facturas" : {
    "transaction" : "GET Facturas",
    "sampleCount" : 150,
    "errorCount" : 44,
    "errorPct" : 29.333334,
    "meanResTime" : 606.0199999999996,
    "medianResTime" : 465.0,
    "minResTime" : 242.0,
    "maxResTime" : 2684.0,
    "pct1ResTime" : 1145.9,
    "pct2ResTime" : 1503.2999999999984,
    "pct3ResTime" : 2642.6900000000005,
    "throughput" : 8.913715236510578,
    "receivedKBytesPerSec" : 79.61119952608747,
    "sentKBytesPerSec" : 1.6103880065961493
  },
  "POST Crear Producto" : {
    "transaction" : "POST Crear Producto",
    "sampleCount" : 500,
    "errorCount" : 11,
    "errorPct" : 2.2,
    "meanResTime" : 552.9720000000001,
    "medianResTime" : 486.5,
    "minResTime" : 180.0,
    "maxResTime" : 1853.0,
    "pct1ResTime" : 1014.9000000000001,
    "pct2ResTime" : 1260.9,
    "pct3ResTime" : 1538.0,
    "throughput" : 21.602937999567942,
    "receivedKBytesPerSec" : 10.329157890473105,
    "sentKBytesPerSec" : 7.1257628537481095
  },
  "GET Solicitudes" : {
    "transaction" : "GET Solicitudes",
    "sampleCount" : 300,
    "errorCount" : 174,
    "errorPct" : 58.0,
    "meanResTime" : 605.6533333333327,
    "medianResTime" : 489.0,
    "minResTime" : 174.0,
    "maxResTime" : 2760.0,
    "pct1ResTime" : 1034.0000000000007,
    "pct2ResTime" : 1443.6,
    "pct3ResTime" : 2660.2600000000007,
    "throughput" : 11.699555416894158,
    "receivedKBytesPerSec" : 39.65349512031043,
    "sentKBytesPerSec" : 2.1365399052336014
  },
  "POST Registro" : {
    "transaction" : "POST Registro",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 57.98,
    "medianResTime" : 26.5,
    "minResTime" : 1.0,
    "maxResTime" : 1035.0,
    "pct1ResTime" : 164.90000000000003,
    "pct2ResTime" : 225.44999999999987,
    "pct3ResTime" : 271.0,
    "throughput" : 11.588828369451848,
    "receivedKBytesPerSec" : 4.753230385907985,
    "sentKBytesPerSec" : 4.85236919109978
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 600.04,
    "medianResTime" : 473.5,
    "minResTime" : 147.0,
    "maxResTime" : 2730.0,
    "pct1ResTime" : 1072.4000000000005,
    "pct2ResTime" : 1351.35,
    "pct3ResTime" : 2647.76,
    "throughput" : 10.526685146847257,
    "receivedKBytesPerSec" : 2.2862644303308888,
    "sentKBytesPerSec" : 2.755030878276431
  },
  "GET Empleado por ID" : {
    "transaction" : "GET Empleado por ID",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 477.71999999999986,
    "medianResTime" : 439.5,
    "minResTime" : 205.0,
    "maxResTime" : 1296.0,
    "pct1ResTime" : 716.9,
    "pct2ResTime" : 1041.599999999999,
    "pct3ResTime" : 1290.9,
    "throughput" : 9.34812414308862,
    "receivedKBytesPerSec" : 1.951786075969089,
    "sentKBytesPerSec" : 1.7892893867630564
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4950,
    "errorCount" : 3047,
    "errorPct" : 61.555557,
    "meanResTime" : 527.4325252525244,
    "medianResTime" : 460.0,
    "minResTime" : 1.0,
    "maxResTime" : 2764.0,
    "pct1ResTime" : 962.6000000000022,
    "pct2ResTime" : 1309.3499999999995,
    "pct3ResTime" : 1901.9799999999996,
    "throughput" : 173.67202301592872,
    "receivedKBytesPerSec" : 584.3739104383026,
    "sentKBytesPerSec" : 41.51305445670479
  },
  "GET Productos" : {
    "transaction" : "GET Productos",
    "sampleCount" : 500,
    "errorCount" : 269,
    "errorPct" : 53.8,
    "meanResTime" : 667.8799999999998,
    "medianResTime" : 522.0,
    "minResTime" : 195.0,
    "maxResTime" : 2712.0,
    "pct1ResTime" : 1160.2000000000007,
    "pct2ResTime" : 1507.55,
    "pct3ResTime" : 2678.7700000000004,
    "throughput" : 19.643278070244364,
    "receivedKBytesPerSec" : 268.56213046083127,
    "sentKBytesPerSec" : 3.5680173057279796
  },
  "POST Crear Empleado" : {
    "transaction" : "POST Crear Empleado",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 81.2066666666667,
    "medianResTime" : 37.0,
    "minResTime" : 1.0,
    "maxResTime" : 1044.0,
    "pct1ResTime" : 176.50000000000009,
    "pct2ResTime" : 245.69999999999993,
    "pct3ResTime" : 1044.0,
    "throughput" : 10.13856032443393,
    "receivedKBytesPerSec" : 4.3267098259547145,
    "sentKBytesPerSec" : 3.895622993409936
  },
  "GET Empleados" : {
    "transaction" : "GET Empleados",
    "sampleCount" : 150,
    "errorCount" : 43,
    "errorPct" : 28.666666,
    "meanResTime" : 572.6333333333333,
    "medianResTime" : 461.0,
    "minResTime" : 188.0,
    "maxResTime" : 2624.0,
    "pct1ResTime" : 861.6,
    "pct2ResTime" : 1553.749999999999,
    "pct3ResTime" : 2590.8500000000004,
    "throughput" : 8.914774753357898,
    "receivedKBytesPerSec" : 14.813848359681446,
    "sentKBytesPerSec" : 1.6192852579341495
  },
  "POST Crear Servicio" : {
    "transaction" : "POST Crear Servicio",
    "sampleCount" : 500,
    "errorCount" : 9,
    "errorPct" : 1.8,
    "meanResTime" : 540.6880000000003,
    "medianResTime" : 467.0,
    "minResTime" : 205.0,
    "maxResTime" : 1854.0,
    "pct1ResTime" : 931.0,
    "pct2ResTime" : 1164.2999999999997,
    "pct3ResTime" : 1846.2100000000007,
    "throughput" : 21.73251619072456,
    "receivedKBytesPerSec" : 10.081001162689615,
    "sentKBytesPerSec" : 6.913274696288086
  }
}